#Примери с някой математически функции

import math #Библиотеката "math" съдържа вградени математически функции
pi = 3.14

#Методът "round()"
# закръгля до най-близкото цяло число, до 0.5 закръгля надолу, а от 0.51 закръгля нагоре.
print(round(pi))

#Методът "math.floor()", закръгля към най-близкото цяло число, надолу.
print(math.floor(4.6))

#Методът "math.ceil()", закръгля към най-близкото цяло число, нагоре.
print(math.ceil(4.2))

#Методът "math.sqrt()", пресмята корен квадратен
print(math.sqrt(pi))

#Методът "math.pow()", повдига на степен, приема два аргумнета, число и степенен показател
print(math.pow(pi,3))

#Методите "min()" и "max()", връщат най-голямото и най-малкото число, от дадени стойности
print(min(2, 4, 3, pi))
print(max(2, 4, 3, pi))