#Примери показващи, вложени цикли, един в друг

#Задачата ни е да начертаем правоъгълник, с даден символ,
# като големината му и символа от който ще е изграден се подават от потребителя

rows = int(input("Колко са редовете: "))
columns = int(input("Колко са колоните: "))
simbol = input("Задайте един символ: ")

while len(simbol) != 1:
    simbol = input("Задайте само един символ: ")

for i in range(rows):
    for j in range(columns):
        print(simbol, end="") #Като добавим втори параметър "end = """, непозволяваме на метода print(),
                              # да премине на нанов ред докато не свършат символите за вътрешния цикъл
    print()
