#Библиотеката рандом, се добавя когато искаме дфа генерираме случайни стойности

import random

x = random.randint(1,6) #Връща произволно цяло число в дадения интервал
print(x)

y = random.random() #Връща произволна стойносто между 0 и 1
print(y)

z = ["pizza", "duner", "kola"]
print(random.choice(z)) # Избира прозиволен елемент от лист


card = ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "J", "Q", "K", "A"]

random.shuffle(card) #Разбърква подредбата на всички елементи
print(card)


