#"Set" (множество), е структора от данни, която е неподредена, няма индексация и не допуска дублиране.
#Ако се добавят няколко елемента с едно и също име се възприемат като един. Могат да се извършват
# и основните действия върху множества :(сечение, обединение, сравнение и т.н.)

food_set = {"Пица", "дюнер", "кебап", "Ябълки"}

for i in food_set:
    print(i) # при всяко стартиране, редът в който отпечатва елементите е различен

fruit_set = {"Ябълки", "Круши", "Сливи", "Сливи", "Сливи", "Сливи", "Сливи"}

for i in fruit_set:
    print(i) #Повторението на сливи е пропуснато, отпечатва само веднъж името.

#Методът "intersection", показва общите елементи между две множества
print(food_set.intersection(fruit_set))

#Методът "difference", показва различните елементи неприсъстващи във второто множество
print(food_set.difference(fruit_set))

#Методът "union", обединява двете множества в едно
print(food_set.union(fruit_set))