#Примери как могат да се режат Стрингове (Strings), чрез индексация или "slicе()" метод
#Индекс метода, има три не засължителни параметъра [start:end:stop]

name = "Стоян Методиев"

#Индексацияза започва от '0' и крайния(end) индекс не включен затова,
# колкото броя символи е часта от стринга, която искаме да изрежем,
# трябва интервала да е с едно повече (n+1)
first_name = name[0:5]
last_name = name[6:14]
print(first_name)
print(last_name)

#Параметарът step, е опционален и показва стъпката през която се избират символи:
funki_name = name[0:14:2]
print(funki_name)

#Обръщаме стринга на обратно, като избираме стъпката да е (-1)
reverse_name = name[::-1]
print(reverse_name)

#Методът "slice()", работи подбно на индексацията, но можем да режем различни обекти с него.
#Можем да ползваме, обратна иондексация, като всеки символ има положителен индекс и броенете в обратен ред започва
#с отрицателен индекс.
slice = slice(7,-4)
website = "http://google.com"
website_name = website[slice]
print(website)
print(website_name)