#Програма показваща някой от методиете, при работа със String.

name = "стоян е от шумен "
age = "37"
height = "1.6"

print(name)
#Методът "len()", показва колко символа има в даден стринг
print(len(name))

#Методът "find()", показва даден символ на коя позиция е.
print(name.find("о"))

#Методът "find()", работи и с паразметър, който оказва начало от коя позиция в стринга да започне търсенето, но броенето започва от началото на стринга.
print(name.find("о", 5))

#Методът "capitalize()", преобразува стринга да започне с главна буква.
print(name.capitalize())

#Методът "upper()", преобразува стринга в главни букви.
name = name.upper()
print(name)

#Методът "lower()", преобразува стринга само в малки букви.
name = name.lower()
print(name)

#Методът "isdigit()", връща булева стойност, дали стринга е число. Истина (True), ако е число, Лъжа (False), ако е друг тип.
print(name.isdigit())
print(age.isdigit())
print(height.isdigit()) #Дробните числа не ги отчита за число, връща False.

#Методът "isalpha()", Проверява, дали всички символи в Стрингът са букви, като трябва да имаме предвид, че е чувствителен, към интервал, табулация и нов ред.
print(name.isalpha())
print("stoqn".isalpha())

#Методът "count()", брои колко пъти се среща даден символ в дадения стринг, символът се подава като, параметър.
print(name.count("о"))

#Методът "replace(x,y)", заменя даден символ (x), с даден символ като втори параметър (y), навсякъде в Стринга където се среща
print(name.replace("о","а"))

#Можем да да копираме стринга няколко пъти, като използваме символа за умножение "*" и след него окажем с цифра, колко пъти искаме да се копира.
print(name*3)

